sneaker_proj/app/controllers/buyers_controller.rb

SELECT "buyers".* FROM "buyers"
---
  def index
    @buyers = Buyer.all

SELECT "sales".* FROM "sales"
---
  def purchases
    @sales = Sale.all

INSERT INTO "buyers" ("email", "password_digest", "first_name", "last_name", "sex", "birthday", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @buyer = Buyer.new(buyer_params)

    respond_to do |format|
      if @buyer.save

SELECT  "buyers".* FROM "buyers" WHERE "buyers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_buyer
      @buyer = Buyer.find(params[:id])