sneaker_proj/app/controllers/products_controller.rb

SELECT "categories".* FROM "categories"
---
  def new
    @product = Product.new
    @categories = Category.all

SELECT "categories".* FROM "categories"
---
  def edit
    @categories = Category.all

INSERT INTO "products" ("name", "description", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "boxersa"], ["description", "hihihi"], ["category_id", 1], ["created_at", "2018-12-15 03:58:14.576067"], ["updated_at", "2018-12-15 03:58:14.576067"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save