sneaker_proj/app/controllers/sales_controller.rb

  def index
    @sales = Sale.all
    @buyers = Buyer.all
    @products = Product.all
---
SELECT "sales".* FROM "sales"
SELECT "buyers".* FROM "buyers"
SELECT "products".* FROM "products"

  def new
    @sale = Sale.new
    @products = Product.all
---
SELECT "products".* FROM "products"

  def edit
    @products = Product.all
---
SELECT "products".* FROM "products"

  def create
    @sale = Sale.new(sale_params)
    @sale.seller_id = current_user.id
    @products = Product.all

    respond_to do |format|
      if @sale.save
---
SELECT "products".* FROM "products"
INSERT INTO "sales" ("seller_id", "product_id", "price", "remarks", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["seller_id", 1], ["product_id", 2], ["price", 78.0], ["remarks", "hi"], ["created_at", "2018-12-13 18:06:29.522552"], ["updated_at", "2018-12-13 18:06:29.522552"]]

  def update
    @sale = Sale.find(params[:id])
    @sale.buyer_id = current_user.id
    respond_to do |format|
      if @sale.update(sale_params)
---
SELECT  "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "sales" SET "buyer_id" = ?, "updated_at" = ? WHERE "sales"."id" = ?  [["buyer_id", 1], ["updated_at", "2018-12-14 07:49:32.098685"], ["id", 4]]

  def destroy
    @sale.destroy
---
DELETE FROM "sales" WHERE "sales"."id" = ?  [["id", 1]]

  def own
    @sales = Sale.all
---
SELECT "sales".* FROM "sales"