sneaker_proj/app/controllers/sellers_controller.rb

SELECT "sellers".* FROM "sellers"
---
  def index
    @sellers = Seller.all

INSERT INTO "sellers" ("email", "password_digest", "first_name", "last_name", "sex", "birthday", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @seller = Seller.new(seller_params)

    respond_to do |format|
      if @seller.save

SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_seller
      @seller = Seller.find(params[:id])