sneaker_proj/app/controllers/sessions_controller.rb

SELECT  "sellers".* FROM "sellers" WHERE "sellers"."email" = ? LIMIT ?  [["email", "admin@gmail.com"], ["LIMIT", 1]]
SELECT  "buyers".* FROM "buyers" WHERE "buyers"."email" = ? LIMIT ?  [["email", "admin@gmail.com"], ["LIMIT", 1]]
---
  def create
    user = Seller.find_by(email: params[:session][:email].downcase)
    if user == nil
        user = Buyer.find_by(email: params[:session][:email].downcase)