sneaker_proj/app/controllers/welcome_controller.rb

	def home
		@sales = Sale.all
---
SELECT "sales".* FROM "sales"