sneaker_proj/app/views/sales/index.html.erb

      <tr>
        <td class="td"><%= sale.seller.first_name %> <%= sale.seller.last_name %></td>
---
SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]