sneaker_proj/app/views/sales/own.html.erb

SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
					<% if (seller_logged_in? && (current_user == sale.seller)) && sale.buyer_id.nil? %>
				   		<td class="td"><%= sale.seller.first_name %> <%= sale.seller.last_name %></td>

SELECT  "buyers".* FROM "buyers" WHERE "buyers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
				    <td class="td"><%= sale.seller.first_name %><%= sale.seller.last_name %></td>
					<td class="td"><%= sale.buyer.first_name %><%= sale.buyer.last_name %></td>