sneaker_proj/app/views/sales/show.html.erb

SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong class="text">Seller:</strong>
  <%= @sale.seller.first_name %>

SELECT  "buyers".* FROM "buyers" WHERE "buyers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <% if !@sale.buyer_id.nil?%>
    <%= @sale.buyer.first_name %>