sneaker_proj/app/views/welcome/home.html.erb

SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
      	<% if sale.buyer_id.nil?%>
	        <td class="td"><%= sale.seller.first_name %></td>