sneaker_proj/app/views/buyers/purchases.html.erb

SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "buyers".* FROM "buyers" WHERE "buyers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
				<tr class="td">
				    <td class="td"><%= sale.seller.first_name %> <%= sale.seller.last_name %></td>
					<% if !sale.buyer.nil?%>
					   	<td class="td"><%= sale.buyer.first_name %> <%= sale.buyer.last_name %></td>