sneaker_proj/app/helpers/sessions_helper.rb

SELECT  "buyers".* FROM "buyers" WHERE "buyers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def current_user
    if session[:buyer_id]
      @current_user ||= Buyer.find_by(id: session[:buyer_id])
    elsif session[:seller_id]
      @current_user ||= Seller.find_by(id: session[:seller_id])